# Series

In [167]:
import numpy as np
import pandas as pd

In [168]:
labels = ['a', 'b',' c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [169]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [170]:
pd.Series(data = my_data, index = labels)

a     10
b     20
 c    30
dtype: int64

In [171]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [172]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [173]:
pd.Series(labels)

0     a
1     b
2     c
dtype: object

In [174]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany','USSR','Japan'])

In [175]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [176]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [177]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [178]:
ser1['USA']

1

In [179]:
ser3 = pd.Series(data = labels)

In [180]:
ser3

0     a
1     b
2     c
dtype: object

In [181]:
ser3[0]

'a'

In [182]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes

In [183]:
from numpy.random import randn

In [184]:
np.random.seed(101)

In [185]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [186]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [187]:
df['W'] #izdvaja kolonu

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [188]:
type(df['W']) #kad se izdvaja kolona izdvaja se kao series

pandas.core.series.Series

In [189]:
type(df)

pandas.core.frame.DataFrame

In [190]:
df.W #retko kad koristiti ovo, moze se zbuniti i pomesati sa metodom, bolje u uglastim zagradama

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [191]:
df[['W','Z']] #jedna kolona - series ; dve kolone - dataframe

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [192]:
df['new'] = df['W'] + df['Y']

In [193]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
df.drop('new', axis = 1, inplace=True) #axis 1 je za kolonu, axis 2 je za vrstu, inplace=True da li se uklanja legit iz dataframe-a

In [ ]:
df

In [ ]:
df.drop('E') #ne pisem za axis=0 jer je E vec vrsta

In [ ]:
df.shape #vraca tuple, (x,y) x je nulti za vrste a y 1 za kolone zbog indeksiranja

In [ ]:
df[['Z','X']]

In [ ]:
df

In [ ]:
df.loc['A'] #LOC SAMO ZA VRSTE

In [ ]:
df.iloc[2] #loc je kada koristim naziv vrste, iloc je indeks vrste

In [ ]:
df.loc['B', 'Y']

In [ ]:
df.loc[['A','B'],['W','Y']]

In [ ]:
bool_df = df > 0

In [ ]:
df[bool_df]

In [ ]:
df

In [ ]:
df['W']>0

In [ ]:
df[df['W']>0]

In [ ]:
df[df['Z']<0]

In [ ]:
resultdf = df[df['W']>0]

In [ ]:
resultdf['X']

In [ ]:
df[df['W']>0]['X']

In [ ]:
df[(df['W']>0) | (df['Y']>1)]

In [ ]:
df.reset_index() #inplace = true

In [ ]:
newind = 'CA NY WY OR CO'.split()

In [ ]:
newind

In [ ]:
df['State'] = newind

In [ ]:
df

In [ ]:
df.set_index('State')

# Hierarchy index

In [81]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [82]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
list(zip(outside, inside))

In [85]:
df =pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [87]:
df.loc['G1'].loc[1]

A    0.681209
B    1.035125
Name: 1, dtype: float64

In [88]:
df.index.names = ['Groups', 'Num']

In [89]:
df

                   A         B
Groups Num
G1     1    0.681209  1.035125
       2   -0.031160  1.939932
       3   -1.005187 -0.741790
G2     1    0.187125 -0.732845
       2   -1.382920  1.482495
       3    0.961458 -2.141212

In [91]:
df.loc['G2'].loc[2]['B']

1.48249549608345

In [93]:
df.xs('G1')

            A         B
Num
1    0.681209  1.035125
2   -0.031160  1.939932
3   -1.005187 -0.741790

In [94]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.681209  1.035125
G2      0.187125 -0.732845

# Missing data

In [95]:
d = {'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}

In [96]:
df = pd.DataFrame(d)

In [97]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
df.dropna() #izbacuje redove koji imaju nedostajuce vrednosti po defaultu

     A    B  C
0  1.0  5.0  1

In [99]:
df.dropna(axis=1) #axis=1 za kolone

   C
0  1
1  2
2  3

In [101]:
df.dropna(thresh=2) #kolona ili red koji ima vise NaN od thresholda se izbacuju

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [102]:
df.fillna(value='fill value')

            A           B  C
0         1.0         5.0  1
1         2.0  fill value  2
2  fill value  fill value  3

In [103]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [105]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [106]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [109]:
df = pd.DataFrame(data)

In [110]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [112]:
byComp = df.groupby('Company')

In [113]:
byComp.mean() #.sum(), .std()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [115]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [116]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [117]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [119]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [124]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, joining and concactenating

In [ ]:
# pd.concat([df1,df2,df3]) spaja redove, tj jedno ispod drugog df, axis=1 za kolone
# pd.merge(df1, df2, how='inner', on='key')
# pd1.join(pd2)

# Operations

In [125]:
df = pd.DataFrame({'col1':[1,2,3,4],
                    'col2':[444,555,666,444],
                    'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [129]:
df['col2'].nunique() # moze i len(df)

3

In [130]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [131]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [132]:
def times2(x):
    return x*2

In [134]:
df['col1'].apply(times2) #apply je da primeni funkciju na nas df ili deo df

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [139]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [140]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [141]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [142]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [144]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [146]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [147]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [148]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [149]:
df.pivot_table(values = 'D', index = ['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data i/o

In [150]:
pwd

'c:\\Users\\Novak Jankovic\\Documents\\Python for Data Science and ML Bootcamp\\Lekcija 3 - Pandas'

In [151]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [152]:
df = pd.read_csv('example')

In [154]:
df.to_csv('MY_OUTPUT', index=False)

In [155]:
pd.read_csv('MY_OUTPUT')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [161]:
import openpyxl
pd.read_excel('Excel_Sample.xlsx', 'Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [162]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [164]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [165]:
type(data)

list

In [166]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645